{
    "version": "https://jsonfeed.org/version/1",
    "title": "Aloma Huang",
    "description": "",
    "home_page_url": "https://alomahuang.com",
    "feed_url": "https://alomahuang.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "alomahunag"
    },
    "items": [
        {
            "id": "https://alomahuang.com/unity-of-thought-and-action-or-trying-to-actually-do-things.html",
            "url": "https://alomahuang.com/unity-of-thought-and-action-or-trying-to-actually-do-things.html",
            "title": "Unity of Thought and Action (Or, Trying to Actually Do Things)",
            "summary": "This year, I’m attempting something radical: actually doing the things I think about. Novel concept, right? My brain? A nonstop idea factory. Business plans, creative projects, self-improvement schemes—I dream them up like it’s my job. And in those fleeting moments, I genuinely believe I’m about&hellip;",
            "content_html": "<p>This year, I’m attempting something radical: actually doing the things I think about. Novel concept, right?  </p><h2 id=\"the-eternal-struggle-of-thinking-vs-doing\">The Eternal Struggle of Thinking vs. Doing</h2>\n<p>My brain? A nonstop idea factory. Business plans, creative projects, self-improvement schemes—I dream them up like it’s my job. And in those fleeting moments, I <em>genuinely</em> believe I’m about to change my life.  </p><p>Reality check: I’m probably still in bed, phone in hand, scrolling, convincing myself that <em>thinking</em> about doing something is basically the same as <em>doing</em> it.<br>Spoiler: it’s not.  </p><h2 id=\"the-lightbulb-moment\">The Lightbulb Moment</h2>\n<p>Then one day, mid-procrastination spiral, a phrase popped into my head: <strong>unity of thought and action.</strong>  </p><p>Maybe that’s what I need—not just grand ideas, not just impulsive action, but the two working together.  </p><h2 id=\"the-other-extreme-doing-without-thinking\">The Other Extreme: Doing Without Thinking</h2>\n<p>To be fair, I don’t <em>only</em> overthink—I also occasionally dive headfirst into action without much strategy. The result?  </p><ul>\n<li>Wasted energy on things that don’t matter  </li>\n<li>A to-do list full of half-finished projects  </li>\n<li>The realization that enthusiasm alone doesn’t equal progress</li>\n</ul>\n<p>So for me, real <strong>unity of thought and action</strong> isn’t about acting on every whim—it’s about thinking clearly <em>before</em> acting, then actually following through.   </p><h2 id=\"this-blog-as-my-hopefully-helpful-nudge\">This Blog as My (Hopefully) Helpful Nudge</h2>\n<p>Since my brain likes to trick me into feeling productive when I’m just thinking, I need something to keep me honest. Writing it all down feels like a small step, but maybe small steps are enough to start.  </p><p>By putting my thoughts out here, I hope to:  </p><ol>\n<li>Turn vague ideas into something real  </li>\n<li>Share them with <em>actual people</em> (not just the inside of my head)  </li>\n<li>Create a little accountability—because if I say it out loud, I <em>should</em> probably try to do it</li>\n</ol>\n<h2 id=\"keep-me-accountable-okay\">Keep Me Accountable, Okay?</h2>\n<p>So, if you’re reading this—congrats, you’re now part of my anti-procrastination support group. No pressure, but feel free to call me out if I start overthinking again.  </p><p>Let’s see if I can turn all these thoughts into something real. 🚀  </p>",
            "image": "https://alomahuang.com/media/posts/3/jeremy-bishop-4xXIX_qFy3c-unsplash.jpg",
            "author": {
                "name": "alomahunag"
            },
            "tags": [
            ],
            "date_published": "2025-02-11T14:29:32+01:00",
            "date_modified": "2025-02-11T14:34:55+01:00"
        }
    ]
}
